{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<|endoftext|>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "¡": 95,
      "¢": 96,
      "£": 97,
      "¤": 98,
      "¥": 99,
      "¦": 100,
      "§": 101,
      "¨": 102,
      "©": 103,
      "ª": 104,
      "«": 105,
      "¬": 106,
      "®": 107,
      "¯": 108,
      "°": 109,
      "±": 110,
      "²": 111,
      "³": 112,
      "´": 113,
      "µ": 114,
      "¶": 115,
      "·": 116,
      "¸": 117,
      "¹": 118,
      "º": 119,
      "»": 120,
      "¼": 121,
      "½": 122,
      "¾": 123,
      "¿": 124,
      "À": 125,
      "Á": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "Ç": 132,
      "È": 133,
      "É": 134,
      "Ê": 135,
      "Ë": 136,
      "Ì": 137,
      "Í": 138,
      "Î": 139,
      "Ï": 140,
      "Ð": 141,
      "Ñ": 142,
      "Ò": 143,
      "Ó": 144,
      "Ô": 145,
      "Õ": 146,
      "Ö": 147,
      "×": 148,
      "Ø": 149,
      "Ù": 150,
      "Ú": 151,
      "Û": 152,
      "Ü": 153,
      "Ý": 154,
      "Þ": 155,
      "ß": 156,
      "à": 157,
      "á": 158,
      "â": 159,
      "ã": 160,
      "ä": 161,
      "å": 162,
      "æ": 163,
      "ç": 164,
      "è": 165,
      "é": 166,
      "ê": 167,
      "ë": 168,
      "ì": 169,
      "í": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ñ": 174,
      "ò": 175,
      "ó": 176,
      "ô": 177,
      "õ": 178,
      "ö": 179,
      "÷": 180,
      "ø": 181,
      "ù": 182,
      "ú": 183,
      "û": 184,
      "ü": 185,
      "ý": 186,
      "þ": 187,
      "ÿ": 188,
      "Ā": 189,
      "ā": 190,
      "Ă": 191,
      "ă": 192,
      "Ą": 193,
      "ą": 194,
      "Ć": 195,
      "ć": 196,
      "Ĉ": 197,
      "ĉ": 198,
      "Ċ": 199,
      "ċ": 200,
      "Č": 201,
      "č": 202,
      "Ď": 203,
      "ď": 204,
      "Đ": 205,
      "đ": 206,
      "Ē": 207,
      "ē": 208,
      "Ĕ": 209,
      "ĕ": 210,
      "Ė": 211,
      "ė": 212,
      "Ę": 213,
      "ę": 214,
      "Ě": 215,
      "ě": 216,
      "Ĝ": 217,
      "ĝ": 218,
      "Ğ": 219,
      "ğ": 220,
      "Ġ": 221,
      "ġ": 222,
      "Ģ": 223,
      "ģ": 224,
      "Ĥ": 225,
      "ĥ": 226,
      "Ħ": 227,
      "ħ": 228,
      "Ĩ": 229,
      "ĩ": 230,
      "Ī": 231,
      "ī": 232,
      "Ĭ": 233,
      "ĭ": 234,
      "Į": 235,
      "į": 236,
      "İ": 237,
      "ı": 238,
      "Ĳ": 239,
      "ĳ": 240,
      "Ĵ": 241,
      "ĵ": 242,
      "Ķ": 243,
      "ķ": 244,
      "ĸ": 245,
      "Ĺ": 246,
      "ĺ": 247,
      "Ļ": 248,
      "ļ": 249,
      "Ľ": 250,
      "ľ": 251,
      "Ŀ": 252,
      "ŀ": 253,
      "Ł": 254,
      "ł": 255,
      "Ń": 256,
      "ĠĠ": 257,
      "ĠĠĠĠ": 258,
      "čĊ": 259,
      "ĠĠĠ": 260,
      "ĠĠĠĠĠĠĠĠ": 261,
      "se": 262,
      "re": 263,
      "ĠĠĠĠĠĠĠ": 264,
      "in": 265,
      "on": 266,
      "st": 267,
      "Ġ=": 268,
      "or": 269,
      "er": 270,
      "at": 271,
      "de": 272,
      "sel": 273,
      "self": 274,
      "ar": 275,
      "le": 276,
      "me": 277,
      "Ġ'": 278,
      "Ġi": 279,
      "al": 280,
      "ĠĠĠĠĠĠĠĠĠĠĠ": 281,
      "Ġre": 282,
      "):": 283,
      "ge": 284,
      "ur": 285,
      "ro": 286,
      "te": 287,
      "as": 288,
      "an": 289,
      "Ġself": 290,
      "def": 291,
      "',": 292,
      "ion": 293,
      "en": 294,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 295,
      "ct": 296,
      "Ġf": 297,
      "ce": 298,
      "Ġp": 299,
      "mp": 300,
      "co": 301,
      "ue": 302,
      "it": 303,
      "ame": 304,
      "Ġdef": 305,
      "Ġif": 306,
      "tur": 307,
      "Ġt": 308,
      "turn": 309,
      "Ġin": 310,
      "Ġe": 311,
      "Ġreturn": 312,
      "ser": 313,
      "get": 314,
      "ort": 315,
      "nt": 316,
      "Ġc": 317,
      "pe": 318,
      "name": 319,
      "lo": 320,
      "()": 321,
      "ing": 322,
      "ma": 323,
      "('": 324,
      "ut": 325,
      "ab": 326,
      "one": 327,
      "Ġs": 328,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 329,
      "fi": 330,
      "li": 331,
      "ad": 332,
      "Ġn": 333,
      "ch": 334,
      "None": 335,
      "mport": 336,
      "':": 337,
      "ate": 338,
      "arg": 339,
      "Ġd": 340,
      "and": 341,
      "ect": 342,
      "Ġo": 343,
      "am": 344,
      "__": 345,
      "Ġ\"": 346,
      "')": 347,
      "ul": 348,
      "val": 349,
      "set": 350,
      "id": 351,
      "ver": 352,
      "rom": 353,
      "ck": 354,
      "ot": 355,
      "qu": 356,
      "tr": 357,
      "str": 358,
      "con": 359,
      "ation": 360,
      "value": 361,
      "int": 362,
      "ult": 363,
      "Ġ+": 364,
      "bo": 365,
      "um": 366,
      "pt": 367,
      "able": 368,
      "Ġm": 369,
      "))": 370,
      "et": 371,
      "ĠNone": 372,
      "ss": 373,
      "ass": 374,
      "col": 375,
      "bj": 376,
      "._": 377,
      "']": 378,
      "['": 379,
      "un": 380,
      "ment": 381,
      "**": 382,
      "ath": 383,
      "cl": 384,
      "ĠĠĠĠĠ": 385,
      "Ġfor": 386,
      "Ġimport": 387,
      "from": 388,
      "ype": 389,
      "el": 390,
      "args": 391,
      "Ġw": 392,
      "ap": 393,
      "ent": 394,
      "il": 395,
      "di": 396,
      "sp": 397,
      "Ġ(": 398,
      "end": 399,
      "Ġh": 400,
      "art": 401,
      "ĠT": 402,
      "Ġ[": 403,
      "Ġex": 404,
      "\",": 405,
      "sert": 406,
      "la": 407,
      "Ġ==": 408,
      "que": 409,
      "age": 410,
      "assert": 411,
      "Ġr": 412,
      "ke": 413,
      "pec": 414,
      "ve": 415,
      "th": 416,
      "ste": 417,
      "ror": 418,
      "to": 419,
      "test": 420,
      "file": 421,
      "up": 422,
      "is": 423,
      "(\"": 424,
      "ting": 425,
      "for": 426,
      "Ġis": 427,
      "ance": 428,
      "mo": 429,
      "quest": 430,
      "ure": 431,
      "box": 432,
      "Re": 433,
      "per": 434,
      "bject": 435,
      "Ġnot": 436,
      "ex": 437,
      "ĠS": 438,
      "ic": 439,
      "path": 440,
      "log": 441,
      "vi": 442,
      "ack": 443,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 444,
      "ata": 445,
      "Ġpar": 446,
      "stance": 447,
      "lse": 448,
      "ase": 449,
      "all": 450,
      "iz": 451,
      "Ġelse": 452,
      "Ġ{": 453,
      "Ġ1": 454,
      "ile": 455,
      "pro": 456,
      "class": 457,
      "step": 458,
      "cept": 459,
      "type": 460,
      "sult": 461,
      "che": 462,
      "po": 463,
      "rue": 464,
      "='": 465,
      "our": 466,
      "import": 467,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 468,
      "Ġ0": 469,
      "Ġde": 470,
      "Ġ_": 471,
      "com": 472,
      "user": 473,
      "ai": 474,
      "Ġ%": 475,
      "ime": 476,
      "rint": 477,
      "ery": 478,
      "setting": 479,
      "Ġb": 480,
      "out": 481,
      "es": 482,
      "ource": 483,
      "Ġget": 484,
      "row": 485,
      "Ġtr": 486,
      "ter": 487,
      "ol": 488,
      "add": 489,
      "app": 490,
      "),": 491,
      "Ġcon": 492,
      "ault": 493,
      "dex": 494,
      "Ġse": 495,
      "reg": 496,
      "ord": 497,
      "query": 498,
      "Er": 499,
      "ule": 500,
      "us": 501,
      "Error": 502,
      "ĠF": 503,
      "Ġtest": 504,
      "start": 505,
      "ted": 506,
      "max": 507,
      "ew": 508,
      "nect": 509,
      "cp": 510,
      "alse": 511,
      "])": 512,
      "ER": 513,
      "xt": 514,
      "ri": 515,
      "ys": 516,
      "fo": 517,
      "ken": 518,
      "ff": 519,
      "len": 520,
      "no": 521,
      "ist": 522,
      "par": 523,
      "Ġprint": 524,
      "ive": 525,
      "ub": 526,
      "lin": 527,
      "ute": 528,
      "list": 529,
      "Ġ__": 530,
      "act": 531,
      "ho": 532,
      "read": 533,
      "\")": 534,
      "object": 535,
      "rc": 536,
      "****": 537,
      "source": 538,
      "Ġand": 539,
      "fig": 540,
      "form": 541,
      "spon": 542,
      "Ġv": 543,
      "kw": 544,
      "Ġbox": 545,
      "__(": 546,
      "Ġme": 547,
      "code": 548,
      "mage": 549,
      "time": 550,
      "eld": 551,
      "stat": 552,
      "ĠĠĠĠčĊ": 553,
      "ory": 554,
      "append": 555,
      "ĠTrue": 556,
      "Ġcol": 557,
      "qual": 558,
      "Ġos": 559,
      "request": 560,
      "roup": 561,
      "aise": 562,
      "sponse": 563,
      "pre": 564,
      "ith": 565,
      "Ġexcept": 566,
      "lag": 567,
      "Ġg": 568,
      "ip": 569,
      "Ġvalue": 570,
      "ĠĠĠĠĠĠĠĠčĊ": 571,
      "Con": 572,
      "ec": 573,
      "Ġstr": 574,
      "umn": 575,
      "temp": 576,
      "00": 577,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 578,
      "andle": 579,
      "..": 580,
      "text": 581,
      "ssage": 582,
      "Ġto": 583,
      "Ġor": 584,
      "ET": 585,
      "Ġassert": 586,
      "IN": 587,
      "sc": 588,
      "Ġ@": 589,
      "url": 590,
      "init": 591,
      "mit": 592,
      "Ġar": 593,
      "Ġraise": 594,
      "Ġa": 595,
      "Ġlog": 596,
      "In": 597,
      "ize": 598,
      "connect": 599,
      "ĠFalse": 600,
      "ow": 601,
      "ta": 602,
      "result": 603,
      "asure": 604,
      "Ġfile": 605,
      "instance": 606,
      "default": 607,
      "Ġtry": 608,
      "asurement": 609,
      "he": 610,
      "ject": 611,
      "late": 612,
      "vent": 613,
      "peration": 614,
      "num": 615,
      "settings": 616,
      "put": 617,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 618,
      "key": 619,
      "data": 620,
      "op": 621,
      "unt": 622,
      "Ġu": 623,
      "tric": 624,
      "Ġlen": 625,
      "Ġspec": 626,
      "error": 627,
      "reate": 628,
      "lient": 629,
      "'),": 630,
      "sion": 631,
      "ms": 632,
      "host": 633,
      "kwargs": 634,
      "ind": 635,
      "date": 636,
      "ht": 637,
      "os": 638,
      "Ġ-": 639,
      "Ġx": 640,
      "Ġ[]": 641,
      "AT": 642,
      "ps": 643,
      "Ġco": 644,
      "line": 645,
      "Equal": 646,
      "bam": 647,
      "od": 648,
      "())": 649,
      "ules": 650,
      "Ġy": 651,
      "server": 652,
      "ption": 653,
      "Ġseq": 654,
      "ask": 655,
      "():": 656,
      "word": 657,
      "del": 658,
      "amreg": 659,
      "=\"": 660,
      "Ġname": 661,
      "ction": 662,
      "Ġpath": 663,
      "ition": 664,
      "ler": 665,
      "Ġdi": 666,
      "config": 667,
      "CH": 668,
      "Ser": 669,
      "ite": 670,
      "ĠH": 671,
      "arp": 672,
      "Ġdo": 673,
      "].": 674,
      "est": 675,
      "ib": 676,
      "mand": 677,
      "table": 678,
      "ument": 679,
      "Ġas": 680,
      "index": 681,
      "chema": 682,
      "ield": 683,
      "om": 684,
      "ig": 685,
      "im": 686,
      "Ġon": 687,
      "version": 688,
      "token": 689,
      "bu": 690,
      "spec": 691,
      "ssion": 692,
      "ST": 693,
      "ace": 694,
      "ake": 695,
      "nd": 696,
      "cpu": 697,
      "format": 698,
      "template": 699,
      "go": 700,
      "Ġfrom": 701,
      "ME": 702,
      "})": 703,
      "min": 704,
      "ail": 705,
      "obj": 706,
      "ers": 707,
      "attr": 708,
      "ence": 709,
      "column": 710,
      "rows": 711,
      "Ġeli": 712,
      "Ġelif": 713,
      "RE": 714,
      "SQ": 715,
      "back": 716,
      "ed": 717,
      "uri": 718,
      "assertEqual": 719,
      "Request": 720,
      "jo": 721,
      "Ġdata": 722,
      "--": 723,
      "Ex": 724,
      "Ġpro": 725,
      "Ġtype": 726,
      "Ġobject": 727,
      "values": 728,
      "view": 729,
      "ni": 730,
      "ard": 731,
      "gin": 732,
      "Ġmax": 733,
      "Ġparser": 734,
      "ception": 735,
      "Set": 736,
      "rect": 737,
      "quence": 738,
      "Me": 739,
      "Ġma": 740,
      "info": 741,
      "ert": 742,
      "ari": 743,
      "Ġresult": 744,
      "AG": 745,
      "DE": 746,
      "Val": 747,
      "group": 748,
      "operation": 749,
      "ange": 750,
      "Ġtable": 751,
      "cket": 752,
      "ac": 753,
      "res": 754,
      "steps": 755,
      "Ġ+=": 756,
      "True": 757,
      "lit": 758,
      "tp": 759,
      "mple": 760,
      "loc": 761,
      "load": 762,
      "pert": 763,
      "izer": 764,
      "ariable": 765,
      "'.": 766,
      "AR": 767,
      "ĠP": 768,
      ".__": 769,
      "if": 770,
      "ial": 771,
      "ls": 772,
      "rec": 773,
      "AC": 774,
      "cf": 775,
      "ies": 776,
      "Ġquery": 777,
      "red": 778,
      "argument": 779,
      "OR": 780,
      "da": 781,
      "port": 782,
      "count": 783,
      "join": 784,
      "elp": 785,
      "********": 786,
      "Server": 787,
      "state": 788,
      "Ġpo": 789,
      "command": 790,
      "Ġ>": 791,
      "metric": 792,
      "Ġindex": 793,
      "lose": 794,
      "loat": 795,
      "etch": 796,
      "Ġhas": 797,
      "pos": 798,
      "Ġobjects": 799,
      "Ġdb": 800,
      "Ġ{'": 801,
      "ity": 802,
      "gr": 803,
      "db": 804,
      "Ġsys": 805,
      "dir": 806,
      "low": 807,
      "Name": 808,
      "equence": 809,
      "ger": 810,
      "atch": 811,
      "Ġdefault": 812,
      "ackage": 813,
      "objects": 814,
      "sh": 815,
      "src": 816,
      "ĠĠĠĠĠĠ": 817,
      "ON": 818,
      "try": 819,
      "py": 820,
      "ork": 821,
      "Ġsub": 822,
      ").": 823,
      "md": 824,
      "son": 825,
      "ust": 826,
      "with": 827,
      "},": 828,
      "ator": 829,
      "Ġpass": 830,
      "limit": 831,
      "und": 832,
      "Ġhelp": 833,
      "Ġparse": 834,
      "ly": 835,
      "Ġ2": 836,
      "],": 837,
      "fe": 838,
      "Ġ*": 839,
      "response": 840,
      "arc": 841,
      "comp": 842,
      "unc": 843,
      "Ġdest": 844,
      "Co": 845,
      "ĠD": 846,
      "desc": 847,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 848,
      "andler": 849,
      "Ġuser": 850,
      "Ġkwargs": 851,
      "atab": 852,
      "ature": 853,
      "arch": 854,
      "Ġresponse": 855,
      "route": 856,
      "artition": 857,
      "mod": 858,
      "atabase": 859,
      "jan": 860,
      "mut": 861,
      "umb": 862,
      "uni": 863,
      "propert": 864,
      "jango": 865,
      "verbo": 866,
      "base": 867,
      "create": 868,
      "flag": 869,
      "uid": 870,
      "{'": 871,
      "measurement": 872,
      "tent": 873,
      "Ġflag": 874,
      "getint": 875,
      "lob": 876,
      "dict": 877,
      "Ġexp": 878,
      "ginx": 879,
      "ams": 880,
      "//": 881,
      "FI": 882,
      "LE": 883,
      "vcf": 884,
      "Ġ**": 885,
      "Ġstart": 886,
      "Ġth": 887,
      "uth": 888,
      "string": 889,
      "ils": 890,
      "Table": 891,
      "call": 892,
      "ous": 893,
      "sub": 894,
      "schema": 895,
      "ts": 896,
      "wa": 897,
      "Ġreq": 898,
      "lic": 899,
      "split": 900,
      "iveServer": 901,
      "ecute": 902,
      "image": 903,
      "move": 904,
      "AL": 905,
      "gs": 906,
      "rules": 907,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 908,
      "Ġop": 909,
      "Ġmut": 910,
      "vious": 911,
      "paramreg": 912,
      "Ġms": 913,
      "://": 914,
      "Get": 915,
      "by": 916,
      "client": 917,
      "ĠC": 918,
      "Ġl": 919,
      "Ġset": 920,
      "ĠCon": 921,
      "lection": 922,
      "'])": 923,
      "entation": 924,
      "cpy": 925,
      "status": 926,
      "verse": 927,
      "Handle": 928,
      "SET": 929,
      "Ġst": 930,
      "Ġfn": 931,
      "Ġpy": 932,
      "Ġnew": 933,
      "Ġmo": 934,
      "ssl": 935,
      "vir": 936,
      "project": 937,
      "Ġarcpy": 938,
      "Setting": 939,
      "nii": 940,
      "mon": 941,
      "Ġen": 942,
      "Ġargs": 943,
      "seq": 944,
      "rent": 945,
      "Ġinst": 946,
      "ĠSequence": 947,
      "order": 948,
      "http": 949,
      "Ġout": 950,
      "Ġcmd": 951,
      "yn": 952,
      "'):": 953,
      "([": 954,
      "do": 955,
      "ifi": 956,
      "ĠI": 957,
      "Ġch": 958,
      "Ġsct": 959,
      "Ġwith": 960,
      "dest": 961,
      "+'": 962,
      "Ġwarp": 963,
      "\":": 964,
      "Test": 965,
      "cur": 966,
      "Ġarg": 967,
      "Ġend": 968,
      "meth": 969,
      "Ġinstance": 970,
      "cho": 971,
      "'],": 972,
      "api": 973,
      "close": 974,
      "fake": 975,
      "Ġk": 976,
      "pts": 977,
      "ild": 978,
      "thread": 979,
      "ĠHiveServer": 980,
      "Exception": 981,
      "orm": 982,
      "St": 983,
      "em": 984,
      "event": 985,
      "ump": 986,
      "arget": 987,
      "Ġres": 988,
      "Ġrequest": 989,
      "Ġtime": 990,
      "Ġno": 991,
      "last": 992,
      "air": 993,
      "ĠA": 994,
      "verbose": 995,
      "01": 996,
      "False": 997,
      "Spec": 998,
      "ave": 999
    },
    "merges": [
      "Ġ Ġ",
      "ĠĠ ĠĠ",
      "č Ċ",
      "ĠĠ Ġ",
      "ĠĠĠĠ ĠĠĠĠ",
      "s e",
      "r e",
      "ĠĠĠĠ ĠĠĠ",
      "i n",
      "o n",
      "s t",
      "Ġ =",
      "o r",
      "e r",
      "a t",
      "d e",
      "se l",
      "sel f",
      "a r",
      "l e",
      "m e",
      "Ġ '",
      "Ġ i",
      "a l",
      "ĠĠĠĠĠĠĠĠ ĠĠĠ",
      "Ġ re",
      ") :",
      "g e",
      "u r",
      "r o",
      "t e",
      "a s",
      "a n",
      "Ġ self",
      "de f",
      "' ,",
      "i on",
      "e n",
      "ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ",
      "c t",
      "Ġ f",
      "c e",
      "Ġ p",
      "m p",
      "c o",
      "u e",
      "i t",
      "a me",
      "Ġ def",
      "Ġi f",
      "t ur",
      "Ġ t",
      "tur n",
      "Ġ in",
      "Ġ e",
      "Ġre turn",
      "se r",
      "ge t",
      "or t",
      "n t",
      "Ġ c",
      "p e",
      "n ame",
      "l o",
      "( )",
      "in g",
      "m a",
      "( '",
      "u t",
      "a b",
      "on e",
      "Ġ s",
      "ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ",
      "f i",
      "l i",
      "a d",
      "Ġ n",
      "c h",
      "N one",
      "mp ort",
      "' :",
      "at e",
      "ar g",
      "Ġ d",
      "an d",
      "e ct",
      "Ġ o",
      "a m",
      "_ _",
      "Ġ \"",
      "' )",
      "u l",
      "v al",
      "se t",
      "i d",
      "v er",
      "ro m",
      "c k",
      "o t",
      "q u",
      "t r",
      "st r",
      "c on",
      "at ion",
      "val ue",
      "in t",
      "ul t",
      "Ġ +",
      "b o",
      "u m",
      "p t",
      "ab le",
      "Ġ m",
      ") )",
      "e t",
      "Ġ None",
      "s s",
      "as s",
      "co l",
      "b j",
      ". _",
      "' ]",
      "[ '",
      "u n",
      "me nt",
      "* *",
      "at h",
      "c l",
      "ĠĠĠĠ Ġ",
      "Ġf or",
      "Ġi mport",
      "f rom",
      "y pe",
      "e l",
      "arg s",
      "Ġ w",
      "a p",
      "en t",
      "i l",
      "d i",
      "s p",
      "Ġ (",
      "en d",
      "Ġ h",
      "ar t",
      "Ġ T",
      "Ġ [",
      "Ġe x",
      "\" ,",
      "ser t",
      "l a",
      "Ġ= =",
      "q ue",
      "a ge",
      "as sert",
      "Ġ r",
      "k e",
      "pe c",
      "v e",
      "t h",
      "st e",
      "r or",
      "t o",
      "te st",
      "fi le",
      "u p",
      "i s",
      "( \"",
      "t ing",
      "f or",
      "Ġi s",
      "an ce",
      "m o",
      "que st",
      "u re",
      "bo x",
      "R e",
      "p er",
      "bj ect",
      "Ġn ot",
      "e x",
      "Ġ S",
      "i c",
      "p ath",
      "lo g",
      "v i",
      "a ck",
      "ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ",
      "at a",
      "Ġp ar",
      "st ance",
      "l se",
      "a se",
      "al l",
      "i z",
      "Ġe lse",
      "Ġ {",
      "Ġ 1",
      "i le",
      "p ro",
      "cl ass",
      "ste p",
      "ce pt",
      "t ype",
      "s ult",
      "ch e",
      "p o",
      "r ue",
      "= '",
      "o ur",
      "i mport",
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ",
      "Ġ 0",
      "Ġ de",
      "Ġ _",
      "co m",
      "u ser",
      "a i",
      "Ġ %",
      "i me",
      "r int",
      "er y",
      "set ting",
      "Ġ b",
      "o ut",
      "e s",
      "our ce",
      "Ġ get",
      "ro w",
      "Ġt r",
      "t er",
      "o l",
      "ad d",
      "ap p",
      ") ,",
      "Ġc on",
      "a ult",
      "de x",
      "Ġ se",
      "re g",
      "or d",
      "qu ery",
      "E r",
      "u le",
      "u s",
      "Er ror",
      "Ġ F",
      "Ġ test",
      "st art",
      "te d",
      "ma x",
      "e w",
      "n ect",
      "c p",
      "al se",
      "] )",
      "E R",
      "x t",
      "r i",
      "y s",
      "f o",
      "k en",
      "f f",
      "le n",
      "n o",
      "i st",
      "p ar",
      "Ġp rint",
      "i ve",
      "u b",
      "l in",
      "u te",
      "li st",
      "Ġ __",
      "a ct",
      "h o",
      "re ad",
      "\" )",
      "o bject",
      "r c",
      "** **",
      "s ource",
      "Ġ and",
      "fi g",
      "for m",
      "sp on",
      "Ġ v",
      "k w",
      "Ġ box",
      "__ (",
      "Ġ me",
      "co de",
      "ma ge",
      "t ime",
      "el d",
      "st at",
      "ĠĠĠĠ čĊ",
      "or y",
      "app end",
      "ĠT rue",
      "Ġ col",
      "qu al",
      "Ġo s",
      "re quest",
      "ro up",
      "ai se",
      "spon se",
      "p re",
      "it h",
      "Ġex cept",
      "la g",
      "Ġ g",
      "i p",
      "Ġ value",
      "ĠĠĠĠĠĠĠĠ čĊ",
      "C on",
      "e c",
      "Ġ str",
      "um n",
      "te mp",
      "0 0",
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ",
      "and le",
      ". .",
      "te xt",
      "ss age",
      "Ġt o",
      "Ġ or",
      "E T",
      "Ġ assert",
      "I N",
      "s c",
      "Ġ @",
      "ur l",
      "in it",
      "m it",
      "Ġ ar",
      "Ġr aise",
      "Ġ a",
      "Ġ log",
      "I n",
      "iz e",
      "con nect",
      "ĠF alse",
      "o w",
      "t a",
      "re sult",
      "as ure",
      "Ġf ile",
      "in stance",
      "def ault",
      "Ġtr y",
      "asure ment",
      "h e",
      "j ect",
      "l ate",
      "v ent",
      "per ation",
      "n um",
      "setting s",
      "p ut",
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ",
      "ke y",
      "d ata",
      "o p",
      "u nt",
      "Ġ u",
      "tr ic",
      "Ġ len",
      "Ġs pec",
      "er ror",
      "re ate",
      "li ent",
      "') ,",
      "s ion",
      "m s",
      "ho st",
      "kw args",
      "in d",
      "d ate",
      "h t",
      "o s",
      "Ġ -",
      "Ġ x",
      "Ġ[ ]",
      "A T",
      "p s",
      "Ġ co",
      "lin e",
      "E qual",
      "b am",
      "o d",
      "() )",
      "ule s",
      "Ġ y",
      "ser ver",
      "pt ion",
      "Ġse q",
      "as k",
      "( ):",
      "w ord",
      "de l",
      "am reg",
      "= \"",
      "Ġ name",
      "ct ion",
      "Ġp ath",
      "it ion",
      "l er",
      "Ġd i",
      "con fig",
      "C H",
      "S er",
      "i te",
      "Ġ H",
      "ar p",
      "Ġd o",
      "] .",
      "e st",
      "i b",
      "m and",
      "t able",
      "u ment",
      "Ġ as",
      "in dex",
      "che ma",
      "i eld",
      "o m",
      "i g",
      "i m",
      "Ġ on",
      "ver sion",
      "to ken",
      "b u",
      "s pec",
      "ss ion",
      "S T",
      "a ce",
      "a ke",
      "n d",
      "cp u",
      "form at",
      "temp late",
      "g o",
      "Ġf rom",
      "M E",
      "} )",
      "m in",
      "a il",
      "o bj",
      "er s",
      "at tr",
      "en ce",
      "col umn",
      "row s",
      "Ġe li",
      "Ġeli f",
      "R E",
      "S Q",
      "b ack",
      "e d",
      "ur i",
      "assert Equal",
      "Re quest",
      "j o",
      "Ġd ata",
      "- -",
      "E x",
      "Ġp ro",
      "Ġt ype",
      "Ġo bject",
      "value s",
      "vi ew",
      "n i",
      "ar d",
      "g in",
      "Ġ max",
      "Ġpar ser",
      "cept ion",
      "S et",
      "re ct",
      "qu ence",
      "M e",
      "Ġ ma",
      "in fo",
      "er t",
      "ar i",
      "Ġre sult",
      "A G",
      "D E",
      "V al",
      "g roup",
      "o peration",
      "an ge",
      "Ġt able",
      "ck et",
      "a c",
      "re s",
      "step s",
      "Ġ+ =",
      "T rue",
      "l it",
      "t p",
      "mp le",
      "lo c",
      "lo ad",
      "per t",
      "iz er",
      "ari able",
      "' .",
      "A R",
      "Ġ P",
      ". __",
      "i f",
      "i al",
      "l s",
      "re c",
      "A C",
      "c f",
      "i es",
      "Ġ query",
      "re d",
      "arg ument",
      "O R",
      "d a",
      "p ort",
      "co unt",
      "jo in",
      "el p",
      "**** ****",
      "Ser ver",
      "st ate",
      "Ġp o",
      "com mand",
      "Ġ >",
      "me tric",
      "Ġin dex",
      "lo se",
      "lo at",
      "et ch",
      "Ġh as",
      "po s",
      "Ġobject s",
      "Ġd b",
      "Ġ{ '",
      "it y",
      "g r",
      "d b",
      "Ġs ys",
      "di r",
      "lo w",
      "N ame",
      "e quence",
      "g er",
      "at ch",
      "Ġdef ault",
      "ack age",
      "object s",
      "s h",
      "s rc",
      "ĠĠĠĠ ĠĠ",
      "O N",
      "tr y",
      "p y",
      "or k",
      "Ġs ub",
      ") .",
      "m d",
      "s on",
      "u st",
      "w ith",
      "} ,",
      "at or",
      "Ġp ass",
      "li mit",
      "un d",
      "Ġh elp",
      "Ġpar se",
      "l y",
      "Ġ 2",
      "] ,",
      "f e",
      "Ġ *",
      "re sponse",
      "ar c",
      "co mp",
      "un c",
      "Ġde st",
      "C o",
      "Ġ D",
      "de sc",
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ",
      "and ler",
      "Ġ user",
      "Ġ kwargs",
      "at ab",
      "at ure",
      "ar ch",
      "Ġre sponse",
      "ro ute",
      "art ition",
      "mo d",
      "atab ase",
      "j an",
      "m ut",
      "um b",
      "un i",
      "pro pert",
      "jan go",
      "ver bo",
      "b ase",
      "c reate",
      "f lag",
      "u id",
      "{ '",
      "me asurement",
      "te nt",
      "Ġf lag",
      "get int",
      "lo b",
      "di ct",
      "Ġex p",
      "gin x",
      "am s",
      "/ /",
      "F I",
      "L E",
      "v cf",
      "Ġ **",
      "Ġ start",
      "Ġt h",
      "ut h",
      "str ing",
      "il s",
      "T able",
      "c all",
      "o us",
      "s ub",
      "s chema",
      "t s",
      "w a",
      "Ġre q",
      "li c",
      "sp lit",
      "ive Server",
      "ec ute",
      "i mage",
      "mo ve",
      "A L",
      "g s",
      "r ules",
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ",
      "Ġo p",
      "Ġm ut",
      "vi ous",
      "par amreg",
      "Ġm s",
      ": //",
      "G et",
      "b y",
      "c lient",
      "Ġ C",
      "Ġ l",
      "Ġ set",
      "Ġ Con",
      "le ction",
      "'] )",
      "ent ation",
      "cp y",
      "stat us",
      "ver se",
      "H andle",
      "S ET",
      "Ġ st",
      "Ġf n",
      "Ġp y",
      "Ġn ew",
      "Ġm o",
      "ss l",
      "vi r",
      "pro ject",
      "Ġar cpy",
      "Set ting",
      "ni i",
      "m on",
      "Ġ en",
      "Ġ args",
      "se q",
      "re nt",
      "Ġin st",
      "ĠS equence",
      "ord er",
      "ht tp",
      "Ġo ut",
      "Ġc md",
      "y n",
      "' ):",
      "( [",
      "d o",
      "i fi",
      "Ġ I",
      "Ġc h",
      "Ġs ct",
      "Ġw ith",
      "de st",
      "+ '",
      "Ġw arp",
      "\" :",
      "T est",
      "c ur",
      "Ġ arg",
      "Ġ end",
      "me th",
      "Ġin stance",
      "ch o",
      "'] ,",
      "ap i",
      "c lose",
      "f ake",
      "Ġ k",
      "pt s",
      "il d",
      "th read",
      "ĠH iveServer",
      "Ex ception",
      "or m",
      "S t",
      "e m",
      "e vent",
      "u mp",
      "ar get",
      "Ġre s",
      "Ġre quest",
      "Ġt ime",
      "Ġn o",
      "la st",
      "ai r",
      "Ġ A",
      "verbo se",
      "0 1",
      "F alse",
      "S pec",
      "a ve"
    ]
  }
}